HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCpu_reg.h
/** \\brief  D024, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D024u)

/** \\brief  D028, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D028u)

/** \\brief  D02C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D02Cu)

/** \\brief  D030, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D030u)

/** \\brief  D034, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D034u)

/** \\brief  D038, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D038u)

/** \\brief  D03C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D03Cu)

/** \\brief  FE18, CPU Identification Register TC1.6P */
#define CPU2_CPU_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CPU_ID*)0xF885FE18u)

/** \\brief  E000, CPU Code Protection Execute Enable Register Set */
#define CPU2_CPXE0 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E000u)

/** Alias (User Manual Name) for CPU2_CPXE0.
* To use register names with standard convension, please use CPU2_CPXE0.
*/
#define	CPU2_CPXE_0	(CPU2_CPXE0)

/** \\brief  E004, CPU Code Protection Execute Enable Register Set */
#define CPU2_CPXE1 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E004u)

/** Alias (User Manual Name) for CPU2_CPXE1.
* To use register names with standard convension, please use CPU2_CPXE1.
*/
#define	CPU2_CPXE_1	(CPU2_CPXE1)

/** \\brief  E008, CPU Code Protection Execute Enable Register Set */
#define CPU2_CPXE2 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E008u)

/** Alias (User Manual Name) for CPU2_CPXE2.
* To use register names with standard convension, please use CPU2_CPXE2.
*/
#define	CPU2_CPXE_2	(CPU2_CPXE2)

/** \\brief  E00C, CPU Code Protection Execute Enable Register Set */
#define CPU2_CPXE3 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E00Cu)

/** Alias (User Manual Name) for CPU2_CPXE3.
* To use register names with standard convension, please use CPU2_CPXE3.
*/
#define	CPU2_CPXE_3	(CPU2_CPXE3)

/** \\brief  FD0C, Core Register Access Event */
#define CPU2_CREVT /*lint --e(923)*/ (*(volatile Ifx_CPU_CREVT*)0xF885FD0Cu)

/** \\brief  FE50, CPU Customer ID register */
#define CPU2_CUS_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CUS_ID*)0xF885FE50u)

/** \\brief  FF00, Data General Purpose Register */
#define CPU2_D0 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF00u)

/** \\brief  FF04, Data General Purpose Register */
#define CPU2_D1 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF04u)

/** \\brief  FF28, Data General Purpose Register */
#define CPU2_D10 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF28u)

/** \\brief  FF2C, Data General Purpose Register */
#define CPU2_D11 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF2Cu)

/** \\brief  FF30, Data General Purpose Register */
#define CPU2_D12 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF30u)

/** \\brief  FF34, Data General Purpose Register */
#define CPU2_D13 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF34u)

/** \\brief  FF38, Data General Purpose Register */
#define CPU2_D14 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF38u)

/** \\brief  FF3C, Data General Purpose Register */
#define CPU2_D15 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF3Cu)

/** \\brief  FF08, Data General Purpose Register */
#define CPU2_D2 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF08u)

/** \\brief  FF0C, Data General Purpose Register */
#define CPU2_D3 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF0Cu)

/** \\brief  FF10, Data General Purpose Register */
#define CPU2_D4 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF10u)

/** \\brief  FF14, Data General Purpose Register */
#define CPU2_D5 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF14u)

/** \\brief  FF18, Data General Purpose Register */
#define CPU2_D6 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF18u)

/** \\brief  FF1C, Data General Purpose Register */
#define CPU2_D7 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF1Cu)

/** \\brief  FF20, Data General Purpose Register */
#define CPU2_D8 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF20u)

/** \\brief  FF24, Data General Purpose Register */
#define CPU2_D9 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF24u)

/** \\brief  9018, Data Asynchronous Trap Register */
#define CPU2_DATR /*lint --e(923)*/ (*(volatile Ifx_CPU_DATR*)0xF8859018u)

/** \\brief  FD00, Debug Status Register */
#define CPU2_DBGSR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGSR*)0xF885FD00u)

/** \\brief  FD48, Debug Trap Control Register */
#define CPU2_DBGTCR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGTCR*)0xF885FD48u)

/** \\brief  9040, Data Memory Control Register */
#define CPU2_DCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON0*)0xF8859040u)

/** \\brief  9000, Data Control Register 2 */
#define CPU2_DCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON2*)0xF8859000u)

/** \\brief  FD44, Debug Context Save Area Pointer */
#define CPU2_DCX /*lint --e(923)*/ (*(volatile Ifx_CPU_DCX*)0xF885FD44u)

/** \\brief  901C, Data Error Address Register */
#define CPU2_DEADD /*lint --e(923)*/ (*(volatile Ifx_CPU_DEADD*)0xF885901Cu)

/** \\brief  9020, Data Integrity Error Address Register */
#define CPU2_DIEAR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIEAR*)0xF8859020u)

/** \\brief  9024, Data Integrity Error Trap Register */
#define CPU2_DIETR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIETR*)0xF8859024u)

/** \\brief  FD40, Debug Monitor Start Address */
#define CPU2_DMS /*lint --e(923)*/ (*(volatile Ifx_CPU_DMS*)0xF885FD40u)

/** \\brief  C000, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR0_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C000u)

