HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCpu_reg.h
/** \\brief  E020, CPU Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF880E020u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN2_LA.
* To use register names with standard convension, please use CPU0_SPROT_RGN2_LA.
*/
#define	CPU0_SPROT_RGNLA2	(CPU0_SPROT_RGN2_LA)

/** \\brief  E024, CPU Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF880E024u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN2_UA.
* To use register names with standard convension, please use CPU0_SPROT_RGN2_UA.
*/
#define	CPU0_SPROT_RGNUA2	(CPU0_SPROT_RGN2_UA)

/** \\brief  E038, CPU Safety Protection Region Access Enable Register A */
#define CPU0_SPROT_RGN3_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF880E038u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN3_ACCENA.
* To use register names with standard convension, please use CPU0_SPROT_RGN3_ACCENA.
*/
#define	CPU0_SPROT_RGNACCENA3	(CPU0_SPROT_RGN3_ACCENA)

/** \\brief  E03C, CPU Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGN3_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF880E03Cu)

/** Alias (User Manual Name) for CPU0_SPROT_RGN3_ACCENB.
* To use register names with standard convension, please use CPU0_SPROT_RGN3_ACCENB.
*/
#define	CPU0_SPROT_RGNACCENB3	(CPU0_SPROT_RGN3_ACCENB)

/** \\brief  E030, CPU Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF880E030u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN3_LA.
* To use register names with standard convension, please use CPU0_SPROT_RGN3_LA.
*/
#define	CPU0_SPROT_RGNLA3	(CPU0_SPROT_RGN3_LA)

/** \\brief  E034, CPU Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF880E034u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN3_UA.
* To use register names with standard convension, please use CPU0_SPROT_RGN3_UA.
*/
#define	CPU0_SPROT_RGNUA3	(CPU0_SPROT_RGN3_UA)

/** \\brief  E048, CPU Safety Protection Region Access Enable Register A */
#define CPU0_SPROT_RGN4_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF880E048u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN4_ACCENA.
* To use register names with standard convension, please use CPU0_SPROT_RGN4_ACCENA.
*/
#define	CPU0_SPROT_RGNACCENA4	(CPU0_SPROT_RGN4_ACCENA)

/** \\brief  E04C, CPU Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGN4_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF880E04Cu)

/** Alias (User Manual Name) for CPU0_SPROT_RGN4_ACCENB.
* To use register names with standard convension, please use CPU0_SPROT_RGN4_ACCENB.
*/
#define	CPU0_SPROT_RGNACCENB4	(CPU0_SPROT_RGN4_ACCENB)

/** \\brief  E040, CPU Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF880E040u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN4_LA.
* To use register names with standard convension, please use CPU0_SPROT_RGN4_LA.
*/
#define	CPU0_SPROT_RGNLA4	(CPU0_SPROT_RGN4_LA)

/** \\brief  E044, CPU Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF880E044u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN4_UA.
* To use register names with standard convension, please use CPU0_SPROT_RGN4_UA.
*/
#define	CPU0_SPROT_RGNUA4	(CPU0_SPROT_RGN4_UA)

/** \\brief  E058, CPU Safety Protection Region Access Enable Register A */
#define CPU0_SPROT_RGN5_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF880E058u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN5_ACCENA.
* To use register names with standard convension, please use CPU0_SPROT_RGN5_ACCENA.
*/
#define	CPU0_SPROT_RGNACCENA5	(CPU0_SPROT_RGN5_ACCENA)

/** \\brief  E05C, CPU Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGN5_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF880E05Cu)

/** Alias (User Manual Name) for CPU0_SPROT_RGN5_ACCENB.
* To use register names with standard convension, please use CPU0_SPROT_RGN5_ACCENB.
*/
#define	CPU0_SPROT_RGNACCENB5	(CPU0_SPROT_RGN5_ACCENB)

/** \\brief  E050, CPU Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF880E050u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN5_LA.
* To use register names with standard convension, please use CPU0_SPROT_RGN5_LA.
*/
#define	CPU0_SPROT_RGNLA5	(CPU0_SPROT_RGN5_LA)

/** \\brief  E054, CPU Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF880E054u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN5_UA.
* To use register names with standard convension, please use CPU0_SPROT_RGN5_UA.
*/
#define	CPU0_SPROT_RGNUA5	(CPU0_SPROT_RGN5_UA)

/** \\brief  E068, CPU Safety Protection Region Access Enable Register A */
#define CPU0_SPROT_RGN6_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF880E068u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN6_ACCENA.
* To use register names with standard convension, please use CPU0_SPROT_RGN6_ACCENA.
*/
#define	CPU0_SPROT_RGNACCENA6	(CPU0_SPROT_RGN6_ACCENA)

/** \\brief  E06C, CPU Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGN6_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF880E06Cu)

/** Alias (User Manual Name) for CPU0_SPROT_RGN6_ACCENB.
* To use register names with standard convension, please use CPU0_SPROT_RGN6_ACCENB.
*/
#define	CPU0_SPROT_RGNACCENB6	(CPU0_SPROT_RGN6_ACCENB)

/** \\brief  E060, CPU Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF880E060u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN6_LA.
* To use register names with standard convension, please use CPU0_SPROT_RGN6_LA.
*/
#define	CPU0_SPROT_RGNLA6	(CPU0_SPROT_RGN6_LA)

/** \\brief  E064, CPU Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF880E064u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN6_UA.
* To use register names with standard convension, please use CPU0_SPROT_RGN6_UA.
*/
#define	CPU0_SPROT_RGNUA6	(CPU0_SPROT_RGN6_UA)

/** \\brief  E078, CPU Safety Protection Region Access Enable Register A */
#define CPU0_SPROT_RGN7_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF880E078u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN7_ACCENA.
* To use register names with standard convension, please use CPU0_SPROT_RGN7_ACCENA.
*/
#define	CPU0_SPROT_RGNACCENA7	(CPU0_SPROT_RGN7_ACCENA)

/** \\brief  E07C, CPU Safety Protection Region Access Enable Register B */
#define CPU0_SPROT_RGN7_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF880E07Cu)

/** Alias (User Manual Name) for CPU0_SPROT_RGN7_ACCENB.
* To use register names with standard convension, please use CPU0_SPROT_RGN7_ACCENB.
*/
#define	CPU0_SPROT_RGNACCENB7	(CPU0_SPROT_RGN7_ACCENB)

/** \\brief  E070, CPU Safety Protection Region Lower Address Register */
#define CPU0_SPROT_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF880E070u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN7_LA.
* To use register names with standard convension, please use CPU0_SPROT_RGN7_LA.
*/
#define	CPU0_SPROT_RGNLA7	(CPU0_SPROT_RGN7_LA)

/** \\brief  E074, CPU Safety protection Region Upper Address Register */
#define CPU0_SPROT_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF880E074u)

/** Alias (User Manual Name) for CPU0_SPROT_RGN7_UA.
* To use register names with standard convension, please use CPU0_SPROT_RGN7_UA.
*/
#define	CPU0_SPROT_RGNUA7	(CPU0_SPROT_RGN7_UA)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_Cfg_Cpu1_sprot
 * \{  */

/** \\brief  E100, CPU Safety Protection Register Access Enable Register A */
#define CPU1_SPROT_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_ACCENA*)0xF882E100u)

/** \\brief  E104, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_ACCENB*)0xF882E104u)

/** \\brief  E008, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN0_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E008u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN0_ACCENA.
* To use register names with standard convension, please use CPU1_SPROT_RGN0_ACCENA.
*/
#define	CPU1_SPROT_RGNACCENA0	(CPU1_SPROT_RGN0_ACCENA)

/** \\brief  E00C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN0_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E00Cu)

/** Alias (User Manual Name) for CPU1_SPROT_RGN0_ACCENB.
* To use register names with standard convension, please use CPU1_SPROT_RGN0_ACCENB.
*/
#define	CPU1_SPROT_RGNACCENB0	(CPU1_SPROT_RGN0_ACCENB)

/** \\brief  E000, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E000u)

